<?

# Пишу скрипты, модули с 0 
# PHP <=> 7.4, MySQL, MySQL(i), AJAX
# Author Xaori69otori
# Telegram @Xaori69otori

# Русский язык

$lang = array(

'home'						=>		'Главная',
'auth'						=>		'Вход',
'reg'						=>		'Регистрация',
'recovery'					=>		'Восстановление',
'download'					=>		'Загрузить',
'nick'						=>		'Ник',
'nick-email'				=>		'Ник или Email',
'login'						=>		'Логин',
'password'	   				=>		'Пароль',
'come' 	       				=>		'Войти',
'no-pass' 	       			=>		'Забыли пароль',
'new-account' 	    		=>		'Создать аккаунт',
'yes-rules' 	    		=>		'Я ознакомлен с',
'reg-email' 	    		=>		'Укажите свой настоящий Email, на него придет ссылка для активации аккаунта',
'ruless' 	   				=>		'правилами',
'accept-rules' 	   			=>		'Вы должны принять правила',
'subs' 	       				=>		'Подписки',
'follows'     				=>		'Подписчики',
'publi'     				=>		'Публикации',
'edit'          			=>		'Редактировать',
'delete'        			=>		'Удалить',
'contacts'      			=>		'Контакты',
'feed'          			=>		'Новости',
'profile'       			=>		'Профиль',
'notify'        			=>		'Уведомления',
'direct'        			=>		'Сообщения',
'settings'      			=>		'Настройки',
'adminka'          			=>		'Админка',
'exit'          			=>		'Выход',
'exit'          			=>		'Выход',
'p-subs'          			=>		'Подписаться',
'p-unsubs'          		=>		'Отписаться',
'p-nosubs'          		=>		'Отменить заявку',
'edit-photo'    			=>		'Изменить фото профиля',
'name'          			=>		'Имя',
'user-name'     			=>		'Имя пользователя',
'site'          			=>		'Сайт',
'biog'          			=>		'Биография',
'd-edit'        			=>		'Настройки личной информации',
'email'         			=>		'Электронный адрес',
'phone'         			=>		'Номер телефона',
'floor'         			=>		'Пол',
'birthday'      			=>		'День рождения',
'main-settings' 			=>		'Основные настройки',
'edit-about'    			=>		'Укажите личную информацию, даже если аккаунт используется для компании, домашних животных или другой цели. Эта информация не будет показана в вашем общедоступном профиле',
'privacy'       			=>		'Приватность',
'security'      			=>		'Безопасность',
'account'       			=>		'Аккаунт',
'dakr-mode'     			=>		'Ночной режим',
'lang'          			=>		'Язык сайта',
'balance'       			=>		'Баланс',
'set-view-profile'       	=>		'Смотреть мою страницу могут',
'set-direct'       			=>		'Отправлять мне сообщения могут',
'set-view-fav'       		=>		'Смотреть избранное могут',
'all-users'       			=>		'Все пользователи',
'only-subs'       			=>		'Только подписчики',
'just-me'       			=>		'Только я',
'set-view-profile-text' 	=>		'Если у вас закрытый аккаунт, ваши фото и видео в Ukrgram смогут видеть только люди, которых вы одобрите. Это не касается уже существующих подписчиков',
'set-online'       		=>		'Статус "В сети"',
'set-online-show'       	=>		'Показывать статус "В сети"',
'set-online-text'       	=>		'Разрешить пользователям, на которых вы подписаны, и всем, кому вы отправляете сообщения, видеть, когда вы в сети или когда вы были в сети в последний раз. Если вы выключите эту настройку, вы не увидите статус "В сети" других пользователей.',
'set-pass'       			=>		'Старый пароль',
'set-n-pass'       			=>		'Новый пароль',
'set-n-pass2'       		=>		'Повторите новый пароль',
'set-err-n-pass1'       	=>		'Введите старый и новый пароль',
'set-err-n-pass2'       	=>		'Новый пароль подтвержден неправильно',
'set-err-n-pass3'       	=>		'Введите старый и новый пароль от 3 символов',
'set-err-n-pass4'       	=>		'Кириллица запрещена в старом пароле',
'set-err-n-pass5'       	=>		'Кириллица запрещена в новом пароле',
'set-err-n-pass6'       	=>		'Неправильно введен старый пароль',
'set-n-pass-succes'       	=>		'Пароль изменен',
'no-public'       			=>		'Нет публикаций',
'no-notify'       			=>		'Нет уведомлений',
'no-fav'       				=>		'Нет закладок',
'no-subs'       			=>		'Нет подписок',
'no-follows'       			=>		'Нет подписчиков',
'no-request'       			=>		'Нет заявок',
'no-direct'       			=>		'Нет чатов',
'no-mess'       			=>		'Нет сообщений',
'no-like'       			=>		'Нет лайков',
'no-reg'					=>		'Регистрация временно не работает. <br> Зайдите позже.',
'no-users'       			=>		'Нет пользователей',
'no-admins'       			=>		'Нет администрации',
'no-attach'       			=>		'Нет вложений',
'no-info'       			=>		'Нет информации',
'only-for-subs'       		=>		'Только для подписчиков',
'search'         			=>		'Поиск',
'for-you'         			=>		'Для вас',
'accounts'         			=>		'Аккаунты',
'places'         			=>		'Места',
'tags'         				=>		'Теги',
'search-no'         		=>		'Ничего не найдено',
'help'         				=>		'Помощь',
'sogl'         				=>		'Соглашение',
'male'         				=>		'Мужской',
'female'       				=>		'Женский',
'another'       			=>		'Другой',
'no-sex'       				=>		'Считаю лучше не указывать',
'title'         			=>		'Название',
'save'         				=>		'Сохранить',
'back'         				=>		'Назад',
'text'         				=>		'Текст',
'photo'         			=>		'Фото',
'write'    					=>		'Написать',
'mess'    					=>		'Сообщение',
'your-mess'    				=>		'Ваше сообщение',
'new-public'    			=>		'Новая публикация',
'new-story'    				=>		'Новая сторис',
'upload'    				=>		'Загрузить',
'publish'    				=>		'Опубликовать',
'add'    					=>		'Добавить',
'like'    					=>		'Понравилось',
'liked'    					=>		'Понравилось',
'more'    					=>		'Еще',
'public'    				=>		'Публикация',
'post'    					=>		'Пост',
'stories'    				=>		'Сторис',
'light'    					=>		'Светлая',
'dark'    					=>		'Темная',
'accept'    				=>		'Принять',
'reject'    				=>		'Отклонить',
'signa'    					=>		'Подпись',
'add-signa'    				=>		'Добавить подпись',
'add-place'    				=>		'Добавить место',
'example'    				=>		'Пример',
'data-saved'    			=>		'Данные сохранены',
'clear'    					=>		'Очистить кеш',
'all'    					=>		'Все',
'new'    					=>		'Новые',
'enter-nick'				=>		'Введите ник',
'error-nick'				=>		'Запрещенный ник',
'enter-pass'				=>		'Введите пароль',
'enter-email'	 			=>		'Введите Email',
'err-nick-long' 			=>		'Длина ника должна быть не менее 4-х и не более 30 символов',
'err-nick-lang' 			=>		'Кириллица в нике запрещена',
'err-num' 					=>		'Лишь цифры запрещены',
'err-sym' 					=>		'Использование одних символов запрещено',
'err-pass-long' 			=>		'Длина пароля должна быть не менее 5-ти символов',
'err-nick-close' 			=>		'Аккаунт с таким ником уже существует',
'err-email-close' 			=>		'Аккаунт с таким Email уже существует',
'sent-conf'	 			=>		'На ваш Email отправлено письмо для подтверждения аккаунта',
'sent-pass'	 			=>		'На ваш Email отправлен новый пароль для входа в аккаунт',
'account-act'	 			=>		'Аккаунт активирован',
'err-email'	 			=>		'Email введен неправильно',
'err-pass' 					=>		'Кириллица запрещена в пароле',
'no-account' 				=>		'Аккаунт не найден',
'continue' 					=>		'Продолжить',
'about-us' 					=>		'О нас',
'rules' 					=>		'Правила',
'faq' 						=>		'Вопрос/ответ',
'contacts' 					=>		'Контакты',
'admins' 					=>		'Администрация',
'no-money' 					=>		'Недостаточно средств',
'page' 						=>		'Страница',
'custom' 					=>		'Пользовательская',
'official' 					=>		'Официальная',
'level'    				=>		'Уровень',
'user' 						=>		'Пользователь',
'moder' 					=>		'Модератор',
'admin' 					=>		'Администратор',
'founder' 					=>		'Основатель',
'show-comm' 				=>		'Показать еще комментарии',
'share' 					=>		'Поделиться',
'attach' 					=>		'Вложение',
'upload' 					=>		'Загрузить',
'upload-text' 				=>		'Возможны следующие форматы файлов: png, jpg, jpeg, gif, mp4 и mov. Видеофайлы могут иметь длительность до трех минут и размер не более',
'upload-file' 				=>		'Фото вместе с видео не допускаются',
'upload-type' 				=>		'Недопустимый формат',
'upload-size' 				=>		'Файл слишком большой',
'notify-comm'    			=>		'прокомментировал(а) вашу публикацию',
'notify-like'    			=>		'понравилась ваша публикация',
'notify-follow'    			=>		'подписался на ваши обновления',
'notify-request'    		=>		'Запросы на подписку',
'notify-request-confirm'    =>		'Подтвердить или игнорировать запросы',
'main'    					=>		'Основное',
'contacts'    				=>		'Контакты',
'ban'    					=>		'Бан',
'keywords'    				=>		'Ключевые слова',
'description'    			=>		'Описание',
'access'    				=>		'Доступ',
'access-1'    				=>		'Всем',
'access-2'    				=>		'Только зарегистрированным',
'access-3'    				=>		'Только администрации',
'reg-1'    					=>		'Открытая',
'reg-2'    					=>		'С подтверждением',
'reg-3'    					=>		'Закрытая',
'publics'    				=>		'Публикаций',
'elem'    					=>		'Элементов',
'official-page'    			=>		'Официальная страница',
'video-time'    			=>		'Время видео',
'video-size'    			=>		'Размер видео',
'users'    					=>		'Пользователи',
'blocked'    				=>		'Заблокированные',
'visits'    				=>		'Посещения',
'cause'    					=>		'Причина',
'time'    					=>		'Время',
'block'    					=>		'Заблокировать',
'unlock'    				=>		'Разблокировать',
'ac-block'    				=>		'Аккаунт заблокирован',
'ac-unlock'    				=>		'Аккаунт разблокирован',
'ac-block-time'    			=>		'Аккаунт заблокирован до',
'unmute'    				=>		'Коснитесь, чтобы включить звук',
'keyboard'    				=>		'Нажмите пробел для просмотра далее',
'day1' 		    			=>		'Сегодня в',
'day2' 		    			=>		'Вчера в',
'day3' 		    			=>		'Позавчера в',
'jan' 		    			=>		'Янв',
'feb' 		    			=>		'Фев',
'mar' 		    			=>		'Мар',
'apr' 		    			=>		'Апр',
'may' 		    			=>		'Май',
'jun' 		    			=>		'Июн',
'jul' 		    			=>		'Июл',
'aug' 		    			=>		'Авг',
'sen' 		    			=>		'Сен',
'oct' 		    			=>		'Окт',
'noy' 		    			=>		'Ноя',
'dec' 		    			=>		'Дек',
'ago'         				=>   	'тому',
'hours'       				=>   	'часы',
'minute'       				=>   	'минута',
'minutes'      				=>   	'минуты',
'fromnow'      				=>   	'сейчас',
'seconds'      				=>   	'секунды',
'yesterday'    				=>   	'вчера',
'tomorrow'     				=>   	'завтра',
'days'         				=>   	'дни',
'hour' 		    			=>		'Час',
'day' 		    			=>		'День',
'week' 		    			=>		'Неделя',
'month' 		    		=>		'Месяц',
'months' 		    		=>		'Месяца',
'months2' 		    		=>		'Месяцев',
'year' 		    			=>		'Год',
'january' 		    		=>		'Январь',
'february' 		    		=>		'Февраль',
'march' 		    		=>		'Март',
'april' 		    		=>		'Апрель',
'may' 		    			=>		'Май',
'june' 		    			=>		'Июнь',
'july' 		    			=>		'Июль',
'august' 		    		=>		'Август',
'september' 				=>		'Сентябрь',
'october' 		    		=>		'Октябрь',
'november' 		    		=>		'Ноябрь',
'december' 		    		=>		'Декабрь',
'about-us-text' => '

<div class="mb-10">
Социальная сеть <b>Wondergam</b>!
</div>
<div class="mb-10">
Wondergam - это виртуальное сообщество, где вы можете наслаждаться общением, знакомиться с интересными людьми, делиться фотографиями и видеозаписями, выражать свое мнение, сохранять важные моменты в жизни, общаться в личных чатах и делиться увлекательными моментами вашей жизни.
</div>
Wondergam - ваш источник бесконечных возможностей для социального взаимодействия.

',
'sogl-text' => '

<div class="mb-10">
Признание и согласие с условиями. Пользователь, который регистрируется и использует социальную сеть, автоматически соглашается со всеми условиями данного Соглашения.
</div>
<div class="mb-10">
Ответственность пользователя. Пользователь несет полную ответственность за любую информацию, которую он публикует в социальной сети, включая авторские права и соответствие законам и правилам социальной сети.
</div>
<div class="mb-10">
Взаимодействие с другими пользователями. Пользователь обязуется уважать права и свободы других пользователей, не оскорблять их и не нарушать законы и правила социальной сети.
</div>
<div class="mb-10">
Конфиденциальность данных. Социальная сеть обязуется сохранять конфиденциальность персональных данных пользователей и не передавать их третьим лицам без согласия пользователя, за исключением случаев, предусмотренных законом.
</div>
<div class="mb-10">
Право на удаление. Пользователь имеет право требовать удаления своих данных из социальной сети в любых обстоятельствах.
</div>
<div class="mb-10">
Ответственность социальной сети. Социальная сеть не несет ответственности за любой ущерб, причиненный пользователям или третьим лицам, связанный с использованием социальной сети.
</div>
<div class="mb-10">
Изменения соглашения. Социальная сеть имеет право изменять условия данного Соглашения по своему усмотрению и без уведомления пользователей. Пользователь должен периодически проверять условия данного Соглашения, чтобы ознакомиться с изменениями.
</div>
',
'rules-text' => '

<div class="mb-10">
Поведение пользователей. Пользователи должны вести себя на социальной сети ответственно и уважать других пользователей. Запрещено публиковать оскорбительные, дискриминационные, непристойные или порнографические материалы, а также материалы, содержащие насилие и другие нарушения прав человека.
</div>
<div class="mb-10">
Конфиденциальность данных. Пользователи должны соблюдать правила конфиденциальности данных и не передавать свой логин и пароль третьим лицам. Также запрещено собирать, хранить или использовать информацию других пользователей без их согласия.
</div>
<div class="mb-10">
Авторское право. Пользователи должны соблюдать авторские права и не публиковать материалы, принадлежащие другим лицам без их разрешения. Пользователи не могут использовать материалы, нарушающие авторские права, без согласия их владельцев.
</div>
<div class="mb-10">
Реклама и спам. Запрещено размещать нежелательную рекламу или спам на социальной сети. Коммерческая реклама может быть разрешена только при определенных условиях и с согласия администраторов социальной сети.
</div>
<div class="mb-10">
Нежелательные материалы. Запрещено публиковать на социальной сети материалы, содержащие вирусы, вредоносные программы или другие элементы, которые могут навредить другим пользователям или социальной сети.
</div>
<div class="mb-10">
Взаимодействие с администраторами. Пользователи должны сотрудничать с администраторами социальной сети и сообщать о любых нарушениях правил, которые они замечают.
</div>
',

'contacts-text' 	=>		'Если у вас возникли вопросы, не стесняйтесь связаться с администрацией проекта по следующим контактам: почта - Xaotik1998@gmail.com, или Telegram - @xaori69otori. Мы всегда готовы помочь вам!',

'download-text' 	=>		'Приложение социальной сети Wondergram на Android!',

);

?>