<?

# Пишу скрипты, модули с 0 
# PHP <=> 7.4, MySQL, MySQL(i), AJAX
# Author Xaori69otori
# Telegram @Xaori69otori

# Украинский язык

$lang = array(

'home'						=>		'Главная',
'auth'						=>		'Вхід',
'reg'						=>		'Реєстрація',
'recovery'					=>		'Відновлення',
'download'					=>		'Завантажити',
'nick'						=>		'Нік',
'nick-email'				=>		'Нік чи Email',
'login'						=>		'Логін',
'password' 	   				=>		'Пароль',
'come' 	       				=>		'Увійти',
'no-pass' 	       			=>		'Забули пароль',
'new-account' 	    		=>		'Створити акаунт',
'yes-rules' 	    		=>		'Я ознайомлений з',
'reg-email' 	    		=>		'Вказуйте свій справжній Email, на нього прийде посилання для активації акаунту',
'ruless' 	   				=>		'правилами',
'accept-rules' 	   			=>		'Ви повинні прийняти правила',
'subs' 	       				=>		'Підписки',
'follows'     				=>		'Підписчики',
'publi'     				=>		'Публікації',
'edit'          			=>		'Редагувати',
'delete'        			=>		'Видалити',
'contacts'      			=>		'Контакти',
'feed'          			=>		'Новини',
'profile'       			=>		'Профіль',
'notify'        			=>		'Сповіщення',
'direct'        			=>		'Повідомлення',
'settings'      			=>		'Налаштування',
'adminka'          			=>		'Адмінка',
'exit'          			=>		'Вихід',
'exit'          			=>		'Вихід',
'p-subs'          			=>		'Підписатися',
'p-unsubs'          		=>		'Відписатися',
'p-nosubs'          		=>		'Скасувати заявку',
'edit-photo'    			=>		'Змінити фото профілю',
'name'          			=>		'Ім\'я',
'user-name'     			=>		'Ім\'я користувача',
'site'          			=>		'Сайт',
'biog'          			=>		'Біографія',
'd-edit'        			=>		'Налаштування особистої інформації',
'email'         			=>		'Электронный адрес',
'phone'         			=>		'Номер телефону',
'floor'         			=>		'Стать',
'birthday'      			=>		'День народження',
'main-settings' 			=>		'Основні налаштування',
'edit-about'    			=>		'Вказуйте особисту інформацію, навіть якщо обліковий запис використовується для компанії, домашніх тварин або з іншою метою. Ця інформація не буде показана у вашому загальнодоступному профілі',
'privacy'       			=>		'Приватність',
'security'      			=>		'Безпека',
'account'       			=>		'Аккаунт',
'dakr-mode'     			=>		'Нічний режим',
'lang'          			=>		'Мова сайту',
'balance'       			=>		'Баланс',
'set-view-profile'       	=>		'Переглядати мою сторінку можуть',
'set-direct'       			=>		'Надсилати мені повідомлення можуть',
'set-view-fav'       		=>		'Переглядати вибране можуть',
'all-users'       			=>		'Всі користувачі',
'only-subs'       			=>		'Тільки підписники',
'just-me'       			=>		'Тільки я',
'set-view-profile-text' 	=>		'Якщо у вас закритий обліковий запис, ваші фото та відео в Ukrgram зможуть бачити тільки люди, яких ви схвалите. Це не стосується вже існуючих підписників',
'set-online'       	=>		'Статус "В мережі"',
'set-online-show'       	=>		'Показувати статус "В мережі"',
'set-online-text'       	=>		'Дозволити користувачам, на яких ви підписані, і всім, кому ви надсилаєте повідомлення, бачити, коли ви в мережі або в останній раз були в мережі. Якщо ви вимкнете цю настройку, то не бачитимете статус "В мережі" інших користувачів.',
'set-pass'       			=>		'Старий пароль',
'set-n-pass'       			=>		'Новий пароль',
'set-n-pass2'       		=>		'Повторіть новий пароль',
'set-err-n-pass1'       	=>		'Введіть старый і новий пароль',
'set-err-n-pass2'       	=>		'Новий пароль підтверджено неправильно',
'set-err-n-pass3'       	=>		'Введіть старий та новий пароль від 3 символів',
'set-err-n-pass4'       	=>		'Кирила заборонена у старому паролі',
'set-err-n-pass5'       	=>		'Кирила заборонена в новому паролі',
'set-err-n-pass6'       	=>		'Неправильно введено старий пароль',
'set-n-pass-succes'       	=>		'Пароль змінений',
'no-public'       			=>		'Немає публікацій',
'no-notify'       			=>		'Нет сповіщень',
'no-fav'       				=>		'Немає збережень',
'no-subs'       			=>		'Немає підписок',
'no-follows'       			=>		'Немає підписників',
'no-request'       			=>		'Немає заявок',
'no-direct'       			=>		'Немає чатів',
'no-mess'       			=>		'Немає повідомлень',
'no-like'       			=>		'Немає лайків',
'no-reg'					=>		'Реєстрація тимчасово не працює. <br> Зайдіть пізніше.',
'no-users'       			=>		'Немає користувачів',
'no-admins'       			=>		'Немає адміністрації',
'no-attach'       			=>		'Немає вкладень',
'no-info'       			=>		'Нема інформації',
'only-for-subs'       		=>		'Тільки для підписників',
'search'         			=>		'Пошук',
'for-you'         			=>		'Для вас',
'accounts'         			=>		'Аккаунти',
'places'         			=>		'Місця',
'tags'         				=>		'Мітки',
'search-no'         		=>		'Нічого не знайдено',
'help'         				=>		'Допомога',
'sogl'         				=>		'Угода',
'male'         				=>		'Чоловічий',
'female'       				=>		'Жіночий',
'another'       			=>		'Інший',
'no-sex'       				=>		'Вважаю за краще не вказувати',
'title'         			=>		'Назва',
'save'         				=>		'Зберегти',
'back'         				=>		'Назад',
'text'         				=>		'Текст',
'photo'         			=>		'Фото',
'write'    					=>		'Написати',
'mess'    					=>		'Повідомлення',
'your-mess'    				=>		'Ваше повідомлення',
'new-public'    			=>		'Нова публікація',
'new-story'    				=>		'Новий сторіс',
'upload'    				=>		'Завантажити',
'publish'    				=>		'Опублікувати',
'add'    					=>		'Додати',
'like'    					=>		'Подобається',
'liked'    					=>		'Сподобалось',
'more'    					=>		'Ще',
'public'    				=>		'Публікація',
'post'    					=>		'Пост',
'stories'    				=>		'Сторіс',
'light'    					=>		'Світла',
'dark'    					=>		'Темна',
'accept'    				=>		'Прийняти',
'reject'    				=>		'Відхилити',
'signa'    					=>		'Підпис',
'add-signa'    				=>		'Додати підпис',
'add-place'    				=>		'Додати місце',
'example'    				=>		'Приклад',
'data-saved'    			=>		'Дані збережені',
'clear'    					=>		'Очистити кеш',
'all'    					=>		'Усі',
'new'    					=>		'Нові',
'enter-nick'				=>		'Введіть нік',
'error-nick'				=>		'Заборонений нік',
'enter-pass'				=>		'Введіть пароль',
'enter-email' 	 			=>		'Введіть Email',
'err-nick-long' 	 		=>		'Довжина ніка має бути не менше 4-х і не більше 30 символів',
'err-nick-lang' 	 		=>		'Кирила в ніке заборонена',
'err-num' 	 				=>		'Лише цифри заборонені',
'err-sym' 	 				=>		'Використання одних символів заборонено',
'err-pass-long' 	 		=>		'Довжина пароля має бути не менше 5-ти символів',
'err-nick-close' 	 		=>		'Аккаунт із таким ніком вже існує',
'err-email-close' 	 		=>		'Аккаунт із таким Email вже існує',
'sent-conf' 	 			=>		'На ваш Email надіслано листа для підтвердження акаунту',
'sent-pass' 	 			=>		'На ваш Email відправлено новий пароль для входу до акаунту',
'account-act' 	 			=>		'Аккаунт активовано',
'err-email' 	 			=>		'Email введено неправильно',
'err-pass' 					=>		'Кирила заборонена в паролі',
'no-account' 				=>		'Аккаунт не знайдено',
'continue' 					=>		'Продовжити',
'about-us' 					=>		'Про нас',
'rules' 					=>		'Правила',
'faq' 						=>		'Питання/відповідь',
'contacts' 					=>		'Контакти',
'admins' 					=>		'Адміністрація',
'no-money' 					=>		'Недостатньо коштів',
'page' 						=>		'Сторінка',
'custom' 					=>		'Користувальницька',
'official' 					=>		'Офіційна',
'level'    					=>		'Рівень',
'user' 						=>		'Користувач',
'moder' 					=>		'Модератор',
'admin' 					=>		'Адміністратор',
'founder' 					=>		'Засновник',
'show-comm' 				=>		'Показати ще коментарі',
'share' 					=>		'Поділиться',
'attach' 					=>		'Вкладення',
'upload' 					=>		'Завантажити',
'upload-text' 				=>		'Можливі такі формати файлів: png, jpg, jpeg, gif, mp4 та mov.
Відеофайли можуть мати тривалість до трьох хвилин і розмір не більше',
'upload-file' 				=>		'Фото разом із відео не допускаються',
'upload-type' 				=>		'Неприпустимий формат',
'upload-size' 				=>		'Файл занадто великий',
'notify-comm'    			=>		'прокоментував(ла) вашу публікацію',
'notify-like'    			=>		'подобається ваша публікація',
'notify-follow'    			=>		'підписався на ваші оновлення',
'notify-request'    		=>		'Запити на підписку',
'notify-request-confirm'    =>		'Підтвердити чи ігнорувати запити',
'main'    					=>		'Основне',
'contacts'    				=>		'Контакти',
'ban'    					=>		'Бан',
'keywords'    				=>		'Ключові слова',
'description'    			=>		'Опис',
'access'    				=>		'Доступ',
'access-1'    				=>		'Всім',
'access-2'    				=>		'Тільки зареєстрованим',
'access-3'    				=>		'Тільки адміністрації',
'reg-1'    					=>		'Відкрита',
'reg-2'    					=>		'З підтвердженням',
'reg-3'    					=>		'Закрита',
'publics'    				=>		'Публікацій',
'elem'    					=>		'Єлементів',
'official-page'    			=>		'Офіційна сторінка',
'video-time'    			=>		'Час відео',
'video-size'    			=>		'Розмір відео',
'users'    					=>		'Користувачі',
'blocked'    				=>		'Заблоковані',
'visits'    				=>		'Відвідування',
'cause'    					=>		'Причина',
'time'    					=>		'Час',
'block'    					=>		'Заблокувати',
'unlock'    				=>		'Розблокувати',
'ac-block'    				=>		'Аккаунт заблокований',
'ac-unlock'    				=>		'Аккаунт розблоковано',
'ac-block-time'    			=>		'Акаунт заблоковано до',
'unmute'    				=>		'Торкніться, щоб увімкнути звук',
'keyboard'    				=>		'Натисніть пробіл, щоб переглянути далі',
'day1' 		    			=>		'Сьогодні в',
'day2' 		    			=>		'Вчора в',
'day3' 		    			=>		'Позавчора в',
'jan' 		    			=>		'Янв',
'feb' 		    			=>		'Фев',
'mar' 		    			=>		'Мар',
'apr' 		    			=>		'Апр',
'may' 		    			=>		'Май',
'jun' 		    			=>		'Июн',
'jul' 		    			=>		'Июл',
'aug' 		    			=>		'Авг',
'sen' 		    			=>		'Сен',
'oct' 		    			=>		'Окт',
'noy' 		    			=>		'Ноя',
'dec' 		    			=>		'Дек',

'ago' 		    			=>		'тому',
'hours' 		    		=>		'години',
'minute' 		    		=>		'хвилина',
'minutes' 		    		=>		'хвилин',
'fromnow' 		    		=>		'від тепер',
'seconds' 		    		=>		'секунд',
'yesterday' 		    	=>		'вчора',
'tomorrow' 		    		=>		'завтра',
'days' 		    			=>		'днів',

'hour' 		    			=>		'Година',
'day' 		    			=>		'День',
'week' 		    			=>		'Тиждень',
'month' 		    		=>		'Місяць',
'months' 		    		=>		'Місяця',
'months2' 		    		=>		'Місяців',
'year' 		    			=>		'Год',
'january' 		    		=>		'Січень',
'february' 		    		=>		'Лютий',
'march' 		    		=>		'Березень',
'april' 		    		=>		'Квітень',
'may' 		    			=>		'Травень',
'june' 		    			=>		'Червень',
'july' 		    			=>		'Липень',
'august' 		    		=>		'Серпень',
'september' 				=>		'Вересень',
'october' 		    		=>		'Жовтень',
'november' 		    		=>		'Листопад',
'december' 		    		=>		'Грудень',
'about-us-text' 		    =>		'

<div class="mb-10">
Соціальна мережа <b>Wondergam</b>!
</div>

<div class="mb-10">
Wondergam - це віртуальне суспільство, де ви можете насолоджуватися спілкуванням, знайомитися з цікавими людьми, ділитися фотографіями та відеозаписами, висловлювати свою думку, зберігати важливі моменти в житті, спілкуватися в особистих чатах та ділитися захоплюючими моментами вашого життя. 
</div>

Wondergam – ваше джерело нескінченних можливостей для соціальної взаємодії.

',
'sogl-text' 		    	=>		'

<div class="mb-10">
Визнання та згода з умовами. Користувач, який реєструється та використовує соціальну мережу, автоматично погоджується з усіма умовами даної Угоди.
</div>

<div class="mb-10">
Відповідальність користувача. Користувач несе повну відповідальність за будь-яку інформацію, яку він публікує у соціальній мережі, включаючи авторські права та відповідність законам та правилам соціальної мережі.
</div>

<div class="mb-10">
Взаємодія з іншими користувачами. Користувач зобов\'язується поважати права та свободи інших користувачів, не ображати їх і не порушувати закони та правила соціальної мережі.
</div>

<div class="mb-10">
Конфіденційність даних. Соціальна мережа зобов\'язується зберігати конфіденційність персональних даних користувачів та не передавати їх третім особам без згоди користувача, за винятком випадків, передбачених законом.
</div>

<div class="mb-10">
Право на видалення. Користувач має право вимагати видалення своїх даних з соціальної мережі за будь-яких обставин.
</div>

<div class="mb-10">
Відповідальність соціальної мережі. Соціальна мережа не несе відповідальності за будь-яку шкоду, заподіяну користувачам або третім особам, які пов\'язані з використанням соціальної мережі.
</div>

<div class="mb-10">
Зміни угоди. Соціальна мережа має право змінювати умови даної Угоди за своїм розсудом та без повідомлення користувачів. Користувач повинен періодично перевіряти умови даної Угоди для ознайомлення зі змінами.
</div>

',
'rules-text' 		    	=>		'

<div class="mb-10">
Поведінка користувачів. Користувачі повинні поводитися на соціальній мережі відповідально та поважати інших користувачів. Заборонено публікувати образливі, дискримінаційні, непристойні або порнографічні матеріали, а також матеріали, що містять насильство та інші порушення прав людини.
</div>

<div class="mb-10">
Конфіденційність даних. Користувачі повинні дотримуватися правил конфіденційності даних та не передавати свої логін та пароль третім особам. Також заборонено збирати, зберігати або використовувати інформацію інших користувачів без їх згоди.
</div>

<div class="mb-10">
Авторське право. Користувачі повинні дотримуватися авторських прав та не публікувати матеріали, які належать іншим особам без їх дозволу. Користувачі не можуть використовувати матеріали, що порушують авторські права, без згоди їх власників.
</div>

<div class="mb-10">
Реклама та спам. Заборонено розміщувати непохідну рекламу або спам на соціальній мережі. Комерційна реклама може бути дозволена лише за певних умов та згодою адміністраторів соціальної мережі.
</div>

<div class="mb-10">
Небажані матеріали. Заборонено публікувати на соціальній мережі матеріали, що містять віруси, шкідливі програми або інші елементи, що можуть завдати шкоди іншим користувачам або соціальній мережі.
</div>

<div class="mb-10">
Взаємодія з адміністраторами. Користувачі повинні співпрацювати з адміністраторами соціальної мережі та повідомляти про будь-які порушення правил, які вони спостерігають
</div>

',

'contacts-text' 	=>		'Якщо у вас виникли питання, не соромтеся зв\'язатися з адміністрацією проекту за наступними контактами: пошта - Xaotik1998@gmail.com, або Telegram - @xaori69otori. Ми завжди готові допомогти вам!',

'download-text' 	=>		'Програма соціальної мережі Wondergram на Android!',

);

?>